// 스크립트 언어 개발론
// 격리
// 개발자들이 복잡성을 관리하기 위해서 만든 수단 : 격리

// 앞으로 6주동안 이렇게 격리를 하는 방식의 개발론을 배울 것이다.

// 식 : 하나의 값이 될수 있는 것 
// 변수 : 메모리 주소를 뜻하는 별명 , 해당 데이터의 타입을 가지고 있다.
// 식별자 : 변수의 상위개념

// 자연언어(영어, 한글 등등), 
// 인공 언어(프로그래밍 언어) : 언어 설계자의 의도를 반영한다. 프리미티브 타입으로 정한 것은 설계자의 의도이다.
// 
// 복잡성을 줄인다.
// 상수로 다 하고 변해야 되는 값만 변수로 한다.


// 복잡성 만들때, 방어적 코드를 해야 한다. certain code
// 연산자 중첩시에는 괄호를 써서 오해하지 않도록 코딩한다.

// 코드로 복잡한 사람의 의도와 생각을 표현하기 위해 동일한 기능을 하는 여러 표현문이 있는 이유가 그러하다.
// 제어문으 ㄹ어떻게 쓰고 어떻게 구성하는지를 통해 의도를 나타낼수 있다.

